# YOLOv8 + Swin Transformer Backbone + P2 Small Object Detection
nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75,  768]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.25,  512]

backbone:
  - [-1, 1, SwinBackbone, []]    # 0  [P2_96, P3_192, P4_384, P5_768]
  - [0,  1, Index,        [0]]   # 1  P2  96ch  stride  4
  - [0,  1, Index,        [1]]   # 2  P3 192ch  stride  8
  - [0,  1, Index,        [2]]   # 3  P4 384ch  stride 16
  - [0,  1, Index,        [3]]   # 4  P5 768ch  stride 32

head:
  # ── top-down: P5 → P4 → P3 → P2 ─────────────────────────────────────────
  - [-1,  1, nn.Upsample, [null, 2, "nearest"]]  # 5   up P5→P4
  - [[3, -1], 1, Concat,  [1]]                   # 6   cat P4+up(P5)
  - [-1,  3, C2f,         [384]]                 # 7   neck_P4

  - [-1,  1, nn.Upsample, [null, 2, "nearest"]]  # 8   up neck_P4→P3
  - [[2, -1], 1, Concat,  [1]]                   # 9   cat P3+up
  - [-1,  3, C2f,         [192]]                 # 10  neck_P3

  - [-1,  1, nn.Upsample, [null, 2, "nearest"]]  # 11  up neck_P3→P2
  - [[1, -1], 1, Concat,  [1]]                   # 12  cat P2+up
  - [-1,  3, C2f,         [96]]                  # 13  P2_out (stride 4)

  # ── bottom-up: P2 → P3 → P4 → P5 ────────────────────────────────────────
  - [-1,  1, Conv,        [96, 3, 2]]            # 14  down P2→P3 scale
  - [[10, -1], 1, Concat, [1]]                   # 15  cat neck_P3
  - [-1,  3, C2f,         [192]]                 # 16  P3_out (stride 8)

  - [-1,  1, Conv,        [192, 3, 2]]           # 17  down P3→P4 scale
  - [[7, -1], 1, Concat,  [1]]                   # 18  cat neck_P4
  - [-1,  3, C2f,         [384]]                 # 19  P4_out (stride 16)

  - [-1,  1, Conv,        [384, 3, 2]]           # 20  down P4→P5 scale
  - [[4, -1], 1, Concat,  [1]]                   # 21  cat P5
  - [-1,  3, C2f,         [768]]                 # 22  P5_out (stride 32)

  # ── detect on all 4 scales ───────────────────────────────────────────────
  - [[13, 16, 19, 22], 1, Detect, [nc]]          # 23  Detect P2/P3/P4/P5
