# YOLOv8 + Swin Transformer Backbone + P2 SOD
# Single Detect layer with 4 inputs: P2/P3/P4/P5


nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75,  768]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.25,  512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SwinBackbone, []]   # 0  returns [P2_96, P3_192, P4_384, P5_768]
  - [0,  1, Index,        [0]]  # 1  P2  96ch  stride  4
  - [0,  1, Index,        [1]]  # 2  P3 192ch  stride  8
  - [0,  1, Index,        [2]]  # 3  P4 384ch  stride 16
  - [0,  1, Index,        [3]]  # 4  P5 768ch  stride 32

head:
  # ── top-down path: P5 → P4 → P3 → P2 ────────────────────────────
  - [-1,  1, nn.Upsample,  [null, 2, "nearest"]]  # 5   upsample P5
  - [[3, -1], 1, Concat,   [1]]                   # 6   cat P4 + up(P5)
  - [-1,  3, C2f,          [384]]                 # 7   neck_P4

  - [-1,  1, nn.Upsample,  [null, 2, "nearest"]]  # 8   upsample neck_P4
  - [[2, -1], 1, Concat,   [1]]                   # 9   cat P3 + up
  - [-1,  3, C2f,          [192]]                 # 10  neck_P3

  - [-1,  1, nn.Upsample,  [null, 2, "nearest"]]  # 11  upsample neck_P3
  - [[1, -1], 1, Concat,   [1]]                   # 12  cat P2 + up
  - [-1,  3, C2f,          [96]]                  # 13  P2_out  stride 4

  # ── bottom-up path: P2 → P3 → P4 → P5 ───────────────────────────
  - [-1,  1, Conv,         [96, 3, 2]]            # 14  down P2→P3
  - [[10, -1], 1, Concat,  [1]]                   # 15  cat neck_P3
  - [-1,  3, C2f,          [192]]                 # 16  P3_out  stride 8

  - [-1,  1, Conv,         [192, 3, 2]]           # 17  down P3→P4
  - [[7, -1], 1, Concat,   [1]]                   # 18  cat neck_P4
  - [-1,  3, C2f,          [384]]                 # 19  P4_out  stride 16

  - [-1,  1, Conv,         [384, 3, 2]]           # 20  down P4→P5
  - [[4, -1], 1, Concat,   [1]]                   # 21  cat P5
  - [-1,  3, C2f,          [768]]                 # 22  P5_out  stride 32

  # ── single Detect layer, 4 inputs, that's it ─────────────────────
  - [[13, 16, 19, 22], 1, Detect, [nc]]           # 23  Detect P2/P3/P4/P5
