# Ultralytics YOLOv8 + P2 Small Object Detection head
# Backbone: stock YOLOv8 CSP/C2f (unchanged)
# Neck: PAN-FPN extended down to P2 (stride 4)
# Head: 4-scale Detect on P2/P3/P4/P5

nc: 1   # tuberculosis bacilli
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75,  768]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.25,  512]

# ── Backbone (stock YOLOv8, unmodified) ───────────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv,  [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f,   [128, True]]   # 2
  - [-1, 1, Conv,  [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f,   [256, True]]   # 4
  - [-1, 1, Conv,  [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f,   [512, True]]   # 6
  - [-1, 1, Conv,  [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f,   [1024, True]]  # 8
  - [-1, 1, SPPF,  [1024, 5]]     # 9

# YOLOv8.0s head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, C2f, [128]]  # 17 (P2/4-xsmall)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15, 4], 1, Concat, [1]]  # cat head P3
  - [-1, 3, C2f, [256]]  # 20 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12, 6], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)

  - [[15, 18, 21, 24], 1, Detect, [nc]]  # Detect(P3, P4, P5)

