# YOLOv8 + Swin Transformer Backbone + C3TR at P5 + SOD (P2 head)
# New addition from paper: C3TR replaces plain C2f at P5 stage
# Everything else unchanged from previous yolov8-swin-p2.yaml

nc: 1
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75,  768]
  l: [1.00, 1.00,  512]
  x: [1.00, 1.25,  512]

backbone:
  - [-1, 1, SwinBackbone, []]   # 0  [P2_96, P3_192, P4_384, P5_768]
  - [0,  1, Index,        [0]]  # 1  P2  96ch  stride  4
  - [0,  1, Index,        [1]]  # 2  P3 192ch  stride  8
  - [0,  1, Index,        [2]]  # 3  P4 384ch  stride 16
  - [0,  1, Index,        [3]]  # 4  P5 768ch  stride 32
  # ── NEW from paper: C3TR + SPPF at P5 stage ──────────────────────
  - [-1, 3, C3TR,         [768]]   # 5  C3TR on P5 features
  - [-1, 1, SPPF,         [768, 5]] # 6  SPPF after C3TR

head:
  # ── top-down: P5 → P4 → P3 → P2 ─────────────────────────────────
  - [-1,  1, nn.Upsample,  [null, 2, "nearest"]]  # 7   up P5
  - [[3, -1], 1, Concat,   [1]]                   # 8   cat P4+up(P5)
  - [-1,  3, C2f,          [384]]                 # 9   neck_P4

  - [-1,  1, nn.Upsample,  [null, 2, "nearest"]]  # 10  up neck_P4
  - [[2, -1], 1, Concat,   [1]]                   # 11  cat P3+up
  - [-1,  3, C2f,          [192]]                 # 12  neck_P3

  - [-1,  1, nn.Upsample,  [null, 2, "nearest"]]  # 13  up neck_P3
  - [[1, -1], 1, Concat,   [1]]                   # 14  cat P2+up
  - [-1,  3, C2f,          [96]]                  # 15  P2_out stride 4

  # ── bottom-up: P2 → P3 → P4 → P5 ────────────────────────────────
  - [-1,  1, Conv,         [96, 3, 2]]            # 16  down P2→P3
  - [[12, -1], 1, Concat,  [1]]                   # 17  cat neck_P3
  - [-1,  3, C2f,          [192]]                 # 18  P3_out stride 8

  - [-1,  1, Conv,         [192, 3, 2]]           # 19  down P3→P4
  - [[9, -1], 1, Concat,   [1]]                   # 20  cat neck_P4
  - [-1,  3, C2f,          [384]]                 # 21  P4_out stride 16

  - [-1,  1, Conv,         [384, 3, 2]]           # 22  down P4→P5
  - [[6, -1], 1, Concat,   [1]]                   # 23  cat SPPF output
  - [-1,  3, C2f,          [768]]                 # 24  P5_out stride 32

  # ── single Detect, 4 inputs = SOD ────────────────────────────────
  - [[15, 18, 21, 24], 1, Detect, [nc]]           # 25  Detect P2/P3/P4/P5
