# Ultralytics YOLO11 + C3TR + P2 Small Object Detection (SOD)

nc: 80

scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ------------------------------------------------------------------
# Backbone
# ------------------------------------------------------------------

backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]                 # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]         # 2

  - [-1, 1, Conv, [256, 3, 2]]                # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]         # 4

  - [-1, 1, Conv, [512, 3, 2]]                # 5-P4/16
  - [-1, 2, C3k2, [512, True]]                # 6

  - [-1, 1, Conv, [1024, 3, 2]]               # 7-P5/32

  # ----------- Replace C3k2 with C3TR -----------
  - [-1, 2, C3TR, [1024, True]]               # 8

  - [-1, 1, SPPF, [1024, 5]]                  # 9
  - [-1, 2, C2PSA, [1024]]                    # 10

# ------------------------------------------------------------------
# Head
# ------------------------------------------------------------------

head:

  # ---------------- P5 -> P4 ----------------

  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]              # 14

  # ---------------- P4 -> P3 ----------------

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]              # 18

  # ---------------- P3 -> P2 ----------------

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]              # 22

  # ---------------- P2 -> P3 ----------------

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 18], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]              # 25

  # ---------------- P3 -> P4 ----------------

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]              # 28

  # ---------------- P4 -> P5 ----------------

  - [-1, 1, Conv, [1024, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]              # 31

  # ---------------- Detect ----------------

  - [[22, 25, 28, 31], 1, Detect, [nc]]
